# UnableToDetachGroup Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..UnableToDetachGroup Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to detach the selected attached detail group(s).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToDetachGroup { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToDetachGroup As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToDetachGroup {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace